{"Heavy_Machine_Gun":{"tl":"3","attr":"Dex","enc":"3","magazine":10,"cost":5000,"range":{"normal":500,"max":null},"description":"**_Heavy machine guns_** represent a large family of air- or water-cooled projectile weapons that are usually fed with belts of linked ammunition. HMGs require a vehicle mounting or emplaced firing position for effective results. An HMG magazine contains enough ammunition for 10 rounds of firing, but each round of firing eats 25 credits worth of projectile ammunition.","name":"Heavy Machine Gun"},"Rocket_Launcher":{"tl":"3","attr":"Dex","enc":"2","magazine":1,"cost":4000,"range":{"normal":null,"max":null},"description":"**Rocket launchers** cover a wide variety of man-portable missile launchers of varying degrees of sophistication. The weapons are usually equipped with basic tracking sensors, but are of limited accuracy against human-sized targets. Rocket launchers take a -4 hit penalty against targets of human size or smaller. Unlike most Heavy weapons, rocket launchers can be shoulder-fired without a prepared emplacement to support them.","name":"Rocket Launcher"},"Demo_Charge":{"tl":"3","attr":"None","enc":"1","magazine":-1,"cost":250,"range":{"normal":20,"max":40},"description":"**_Demo Charges_** are the general run of placed explosives beloved of terrorists and adventurers the world over. The usual variety can be detonated by radio signals, timers, or electrical charges, and inflict their damage on any objects within twenty meters, with an Evasion saving throw for half damage. Victims within forty meters take half damage, with an Evasion save for none. The charge is sufficient to blow a four-meter wide hole in anything short of a reinforced wall. PCs with a background in demolitions or Fix-0 skill can shape the charge so it directs the blast in only one direction, sparing all but two meters of the rest.","name":"Demo Charge"},"Railgun":{"tl":"4","attr":"Dex","enc":null,"magazine":20,"cost":8000,"range":{"normal":null,"max":null},"description":"**_Railguns_** are simply scaled-up versions of personal mag rifles. They accelerate large metallic slugs along the weapon’s barrel, creating a steady spray of hypervelocity rounds. Ammunition sufficient for one round of firing costs 50 credits.","name":"Railgun"},"Anti-Vehicle_Laser":{"tl":"4","attr":"Dex","enc":null,"magazine":15,"cost":10000,"range":{"normal":null,"max":null},"description":"**_Anti-vehicle lasers_** are less useful against soft targets, but excel at penetrating vehicle armor. Against vehicles and other hard-skinned targets, damage is rolled twice and the better result is used.","name":"Anti-Vehicle Laser"},"Hydra_Array":{"tl":"4","attr":"Dex","enc":null,"magazine":10,"cost":20000,"range":{"normal":null,"max":null},"description":"**_Hydra arrays_** sequence a number of missile launchers to fire at once. The gunner designates up to three targets and can then make three rolls to hit divided among them. Each successful hit on a target allows the gunner to roll damage once, but only the highest damage roll is applied to the target. Thus, if all three volleys were aimed at a single target and two of them hit, the gunner would roll damage twice and apply the best result. A volley from the array costs 150 credits.","name":"Hydra Array"},"Wheatcutter_Belt":{"tl":"4","attr":"Dex","enc":null,"magazine":5,"cost":10000,"range":{"normal":10,"max":20},"description":"**_Wheatcutter belts_** are one of several different antipersonnel measures often installed on gravtanks and other fighting vehicles. When triggered, a belt of explosives fires off a scything blast of shrapnel on any side of the vehicle. All creatures within 10 meters of that side of the vehicle must make an Evasion save for half damage. Those within 20 meters take half damage, and can make an Evasion save to take none at all. Wheatcutter belts do not ignore a vehicle’s Armor like other Heavy weapons do. Reloading a wheatcutter belt costs 200 credits per round.","name":"Wheatcutter Belt"},"Vortex_Cannon":{"tl":"5","attr":"Dex","enc":null,"magazine":5,"cost":75000,"range":{"normal":null,"max":null},"description":"**_Vortex cannons_** use controlled gravitic shear planes to cause a target to simply fall apart into component fragments. The cannons are silent in operation, but so heavy and complex that they can only be mounted on gravtanks and other similar dedicated fighting vehicles.","name":"Vortex Cannon"}}