{"bugs":[{"type":"bug","locations":["Flying"],"name":"Common butterfly","id":"common-butterfly","monthsAvailable":[9,10,11,12,1,2,3,4,5,6],"icon":"https://acnhapi.com/v1/icons/bugs/1","image":"https://acnhapi.com/v1/images/bugs/1","sellPrice":160,"rarity":"Common","museumFact":"The common butterfly would have you believe it is but a beautiful friend flitting prettily about the flowers. Bah, I say! They may seem innocent things with their pretty white wings, but they hide a dark side! The common butterfly caterpillar is called a cabbage worm, you see, and it's a most voracious pest. The ravenous beasts chew through cabbage, broccoli, kale and the like with a devastating gusto. And my feathers! Their green coloring is truly GROSS! A hoo-rrific hue, I say.","times":[[4,19]]},{"type":"bug","locations":["Flying"],"name":"Yellow butterfly","id":"yellow-butterfly","monthsAvailable":[3,4,5,6,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/2","image":"https://acnhapi.com/v1/images/bugs/2","sellPrice":160,"rarity":"Common","museumFact":"Allow me to enlighten you... The yellow butterfly is named for its yellow wings. Need I say more? If I must, then allow me to note that the female yellow butterfly can lay up to 600 eggs at a time! Bleech! And their creepy crawly caterpillars just love to chomp on clover plants. A recipe for disaster, I say. Just imagine reaching for a four-leaf clover, only to touch a larva instead! Yuck! The worst of luck!","times":[[4,19]]},{"type":"bug","locations":["Flying"],"name":"Tiger butterfly","id":"tiger-butterfly","monthsAvailable":[3,4,5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/3","image":"https://acnhapi.com/v1/images/bugs/3","sellPrice":240,"rarity":"Common","museumFact":"Tiger butterflies are known for their majestic wings, which many consider quite beautiful. Truth be told, I find them monstrous! Those strange striped patterns... They give this owl the goose bumps! And while you may imagine young tiger butterfly larvae to look like lovely green caterpillars...it's not so! Why, when tiger butterflies are but babes, they're covered in unsightly white, brown, and black spots. In this way, they camouflage themselves as...as...bird droppings! Putrid pests, indeed!","times":[[4,19]]},{"type":"bug","locations":["Flying near hybrid flowers"],"name":"Peacock butterfly","id":"peacock-butterfly","monthsAvailable":[3,4,5,6],"icon":"https://acnhapi.com/v1/icons/bugs/4","image":"https://acnhapi.com/v1/images/bugs/4","sellPrice":2500,"rarity":"Uncommon","museumFact":"Pretty as a peacock? Bah, I say! The wings of the peacock butterfly may have a pattern similar to that of the beautiful bird... But its forewings are also often covered in a dark, velvety hair! You heard right! HAIRY wings! A hair-raising revelation indeed!","times":[[4,19]]},{"type":"bug","locations":["Flying"],"name":"Common bluebottle","id":"common-bluebottle","monthsAvailable":[4,5,6,7,8],"icon":"https://acnhapi.com/v1/icons/bugs/5","image":"https://acnhapi.com/v1/images/bugs/5","sellPrice":300,"rarity":"Common","museumFact":"The common bluebottle is a type of swallowtail butterfly with a bright blue line running down its wings. They fly quite nimbly, it seems, and are thus quite difficult to catch. But seeing how they've been known to slurp nutrients from MUD puddles... I simply CAN'T imagine wanting to catch one myself. What awful breath!","times":[[4,19]]},{"type":"bug","locations":["Flying"],"name":"Paper kite butterfly","id":"paper-kite-butterfly","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/6","image":"https://acnhapi.com/v1/images/bugs/6","sellPrice":1000,"rarity":"Common","museumFact":"With its black-and-white-striped wing pattern, the paper kite butterfly is both elegant and pretty... PRETTY POISONOUS I MEAN! Hoo dear! Where was I? Oh yes... Even this butterfly's black-and-white-striped larva and little golden pupae are toxic to predators. Indeed, the paper kite butterfly's foul flavor is famous, and thus birds, in particular, steer clear of the fiends. THIS bird most of all!","times":[[8,19]]},{"type":"bug","locations":["Flying"],"name":"Great purple emperor","id":"great-purple-emperor","monthsAvailable":[5,6,7,8],"icon":"https://acnhapi.com/v1/icons/bugs/7","image":"https://acnhapi.com/v1/images/bugs/7","sellPrice":3000,"rarity":"Rare","museumFact":"The great purple emperor lives high in the treetops and is renowned for its pretty purple-hued wings. Its impressive bird-like wingspan and elusive nature have made it a favorite among butterfly aficionados. But truth be told, the so-called great purple emperor has some not-so-great personal peculiarities. For one...it has two horrid HORNS upon its head when it is in its caterpillar form. For two...it has been known to dine on feces and animal carcasses! Hoo! That's why I call it the Emperor of EWWW!","times":[[4,19]]},{"type":"bug","locations":["Flying"],"name":"Monarch butterfly","id":"monarch-butterfly","monthsAvailable":[9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/8","image":"https://acnhapi.com/v1/images/bugs/8","sellPrice":140,"rarity":"Common","museumFact":"Did you know the monarch butterfly migrates south for the winter and returns north for the summer? Indeed, these horrid orange beasties do not tolerate the cold and travel 3,000 miles to escape the winter. During the journey, they cluster together in trees by the thousands just to stay warm. Imagine! Hordes of the foul flittering fiends huddled together in one place! If only they'd put on tiny coats instead.","times":[[4,17]]},{"type":"bug","locations":["Flying"],"name":"Emperor butterfly","id":"emperor-butterfly","monthsAvailable":[6,7,8,9,12,1,2,3],"icon":"https://acnhapi.com/v1/icons/bugs/9","image":"https://acnhapi.com/v1/images/bugs/9","sellPrice":4000,"rarity":"Uncommon","museumFact":"The emperor butterfly is called the jewel of the forest. But its vivid blue hue... Ewww, let me tell you! The color does not come from a dye, but rather from light reflecting off layers of translucent scales. Yes, butterfly wings are covered in tiny scales! SCALES! Butterfly? Bah! More like snake of the sky!","times":[[0,8],[17,24]]},{"type":"bug","locations":["Flying"],"name":"Agrias butterfly","id":"agrias-butterfly","monthsAvailable":[4,5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/10","image":"https://acnhapi.com/v1/images/bugs/10","sellPrice":3000,"rarity":"Uncommon","museumFact":"Some say the agrias butterfly is one of the most beautiful butterflies in the world. Bah, I say! BAH! They may have brightly colored wings, but the way they flutter and flitter...SO FOUL! In fact, the agrias butterfly flies so fast, it is quite a feat to catch one. I suppose I should congratulate you on your good fortune... But catching any bug seems a misfortune to me.","times":[[8,17]]},{"type":"bug","locations":["Flying"],"name":"Rajah Brooke's birdwing","id":"rajah-brooke's-birdwing","monthsAvailable":[4,5,6,7,8,9,12,1,2],"icon":"https://acnhapi.com/v1/icons/bugs/11","image":"https://acnhapi.com/v1/images/bugs/11","sellPrice":2500,"rarity":"Uncommon","museumFact":"Did you know that the repulsive Rajah Brooke's birdwing loves to luxuriate in hot-springs water? It's true! Hoo! The males gather in groups to sip the moisture while the females hide in jungle trees. And though they dress to impress in red and green, these fluttering fiends are not just stylish... They're also quite malicious! Their little larvae pack a poisonous punch that's supposed to protect them from predators... But I suspect more diabolical designs.","times":[[8,17]]},{"type":"bug","locations":["Flying"],"name":"Queen Alexandra's birdwing","id":"queen-alexandra's-birdwing","monthsAvailable":[5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/12","image":"https://acnhapi.com/v1/images/bugs/12","sellPrice":4000,"rarity":"Rare","museumFact":"Hoo! The horror! This behemoth butterfly may be called a Queen Alexandra's birdwing... But I call it the Queen of My Nightmares! It is huge! Indeed, the world's hugest. No butterfly can best its foot-long wingspan. The larvae alone grow to more than 4 inches. As if that weren't appalling enough...they're poisonous! Murderous monsters, indeed!","times":[[8,16]]},{"type":"bug","locations":["Flying by light"],"name":"Moth","id":"moth","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/13","image":"https://acnhapi.com/v1/images/bugs/13","sellPrice":130,"rarity":"Common","museumFact":"Many think the moth is strictly a nocturnal creature. Alas, no! These frightful fluttering beasts have been known to haunt the daylight and twilight hours too. Thus, there is no time of day one might escape the moth trait I dislike most of all—those feathery antennae! The mere thought of them gives my feathers goosebumps. And I'm no goose.","times":[[0,4],[19,24]]},{"type":"bug","locations":["On trees"],"name":"Atlas moth","id":"atlas-moth","monthsAvailable":[4,5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/14","image":"https://acnhapi.com/v1/images/bugs/14","sellPrice":3000,"rarity":"Uncommon","museumFact":"The Atlas moth is a monstrous thing! Not only is it one of the largest moths in the world... The tips of its wings look rather like the heads of venomous snakes! Despite its largeness and loathsome looks, the adult Atlas moth lives only for a few days. It emerges from its cocoon without a mouth, you see...and so cannot eat. I feel for the poor thing...but it is still foul!","times":[[0,4],[19,24]]},{"type":"bug","locations":["Flying"],"name":"Madagascan sunset moth","id":"madagascan-sunset-moth","monthsAvailable":[4,5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/15","image":"https://acnhapi.com/v1/images/bugs/15","sellPrice":2500,"rarity":"Uncommon","museumFact":"The Madagascan sunset moth is said to be the most beautiful moth in the world...a sentiment even I can't deny. While most moths are nocturnal, this one flutters about during the day, making good use of the light. That is, when the daylight reflects off its wings, a kaleidoscope of colors are revealed! Oh! Eh...too bad it has such startling red feet as a caterpillar. I might have found it almost tolerable otherwise. Almost, but not quite.","times":[[8,16]]},{"type":"bug","locations":["On the ground"],"name":"Long locust","id":"long-locust","monthsAvailable":[4,5,6,7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/16","image":"https://acnhapi.com/v1/images/bugs/16","sellPrice":200,"rarity":"Common","museumFact":"As if the average locust weren't large enough...we must suffer the long locust too! The wretched beasts are known for their unusually long hind legs as well as their elongated heads. But that is hardly the long locusts' worst trait... I tell you, they spit brown goo when they're scared!","times":[[8,19]]},{"type":"bug","locations":["On the ground"],"name":"Migratory locust","id":"migratory-locust","monthsAvailable":[8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/17","image":"https://acnhapi.com/v1/images/bugs/17","sellPrice":600,"rarity":"Uncommon","museumFact":"Ah yes, the lone migratory locust. It seems like such a harmless hopper as it bounces about in the grass. But beware! When these pests band together and travel in swarms, they leave devastation in their wake! Migratory locusts have gathered by the millions throughout history, wiping out crops and causing famine. That's why I always say, \"Never let a locust hang out with its friends!\". That is precisely how a plague begins.","times":[[8,19]]},{"type":"bug","locations":["On the ground"],"name":"Rice grasshopper","id":"rice-grasshopper","monthsAvailable":[8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/18","image":"https://acnhapi.com/v1/images/bugs/18","sellPrice":160,"rarity":"Common","museumFact":"In point of fact, rice grasshoppers are an awful pest! They devour rice plants and wipe out the crucial crop. But revenge is sweet! These bugs are edible, you see, and so some folks eat them as way to get rid of them. When boiled in soy sauce, rice grasshoppers are quite tasty, it's said. Though why anyone would put an insect in their mouth is beyond me. The mere thought gives me the gags!","times":[[8,19]]},{"type":"bug","locations":["On the ground"],"name":"Grasshopper","id":"grasshopper","monthsAvailable":[7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/19","image":"https://acnhapi.com/v1/images/bugs/19","sellPrice":160,"rarity":"Common","museumFact":"Grasshoppers are known for making a \"chirping\" sound. Though it doesn't sound like chirping to me... They make this rude racket by rubbing their hind legs against their wings. And though they eat seeds and pollen, they sometimes prey on smaller insects too. I say! Such violent table manners should not be tolerated! Horrible hoppers.","times":[[8,17]]},{"type":"bug","locations":["On the ground"],"name":"Cricket","id":"cricket","monthsAvailable":[9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/20","image":"https://acnhapi.com/v1/images/bugs/20","sellPrice":130,"rarity":"Common","museumFact":"I say, where shall I start with the cricket? Well, to begin with, they are mostly nocturnal creatures. And for that you day-loving diurnal types should be grateful! Hoo! It means you don't have to lay eyes upon their prickly legs or overly long antennae like us night owls! Of course, crickets are best known for the chirping sound they make by rubbing their wings together. Some find the noise lovely to listen to. Alas, it only serves to remind me of another unpleasant fact... Which is to say...you will find a cricket's ears right next to its knees! I've gone weak in the knees at the mention of it!","times":[[0,8],[17,24]]},{"type":"bug","locations":["On the ground"],"name":"Bell cricket","id":"bell-cricket","monthsAvailable":[9,10],"icon":"https://acnhapi.com/v1/icons/bugs/21","image":"https://acnhapi.com/v1/images/bugs/21","sellPrice":430,"rarity":"Common","museumFact":"The call of the bell cricket heralds the arrival of autumn. And I concede it is a rather pleasant sound. What I do NOT find pleasant is the way these things rub their strange wings together to make their song! Ick and blech! And to make matters worse, bell crickets have been known to shed two of their four wings! And they simply leave these wings where they fall, as if it were litter! I simply cannot abide such odious behavior.","times":[[0,8],[17,24]]},{"type":"bug","locations":["On flowers"],"name":"Mantis","id":"mantis","monthsAvailable":[3,4,5,6,7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/22","image":"https://acnhapi.com/v1/images/bugs/22","sellPrice":430,"rarity":"Common","museumFact":"Hoo! Don't let the mantis's angelic pose fool you...for it is truly monstrous. The mantis is known for its large size and tremendous strength...and for sickle-like arms that pack a punch. And though they tend to eat bugs and spiders...mantises have been known to dine on small animals too! And those eerie eyes! Oh my! Did you know it has five of them! Two big ones and three small! I shall faint if I think on it further...","times":[[8,17]]},{"type":"bug","locations":["On white flowers"],"name":"Orchid mantis","id":"orchid-mantis","monthsAvailable":[3,4,5,6,7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/23","image":"https://acnhapi.com/v1/images/bugs/23","sellPrice":2400,"rarity":"Uncommon","museumFact":"The orchid mantis is a bug whose brilliant colors and petal-shaped limbs give it the look of a flower. This masterful mimicry allows it to hide from predators in among the orchids. But oh this fraudulent flower! It lures other insects in to drink its nectar... And makes a meal of them instead! Imagine! To behold a beautiful bud... only to discover it's a bug instead! A repulsive revelation indeed!","times":[[8,17]]},{"type":"bug","locations":["Flying"],"name":"Honeybee","id":"honeybee","monthsAvailable":[3,4,5,6,7],"icon":"https://acnhapi.com/v1/icons/bugs/24","image":"https://acnhapi.com/v1/images/bugs/24","sellPrice":200,"rarity":"Common","museumFact":"Did you know it takes a team of honeybees working together to transform flower nectar into honey? Indeed, forager bees suck nectar from flowers into their \"honey stomachs\" and then fly it to the hive. Hive bees then chew the substance and spit it into the honeycomb, fluttering their wings to dry it out. Yes, you could say honey is a tasty tribute to the hard work of the humble honeybee. Oh! Oh my! You mustn't confuse my lengthy description for admiration! At the end of the day, honeybees are still insects, and thus still ghastly! A wee bit less ghastly than most, I admit.","times":[[8,17]]},{"type":"bug","locations":["Shaking trees"],"name":"Wasp","id":"wasp","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/25","image":"https://acnhapi.com/v1/images/bugs/25","sellPrice":2500,"rarity":"Common","museumFact":"Hoo! Allow me to share a fact with you! Wasps are sometimes called \"meat bees\" because... They. Eat. MEAT! MEAT! Of almost any sort! Surely you've seen what a menace they make of themselves at picnics. 'Tis hardly the worst of it, wot wot! Aggressive predators with venomous stingers, wasps not only hunt and eat other insects... they paralyze their prey, then drag their victims home ALIVE, leaving them for their larva to feed upon. Suddenly a simple sting seems quite tolerable.","times":[[0,24]]},{"type":"bug","locations":["On trees"],"name":"Brown cicada","id":"brown-cicada","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/26","image":"https://acnhapi.com/v1/images/bugs/26","sellPrice":250,"rarity":"Common","museumFact":"Cicadas are obnoxious insects. And not just brown cicadas, mind you...but all cicadas! They flex ribbed membranes on their torso called tymbals to make a loud snapping sound. So rude! Hoo! Yes, it is only the males who make the noise. Sometimes at a volume that can produce pain at close range! Appallingly inconsiderate, I must say...","times":[[8,17]]},{"type":"bug","locations":["On trees"],"name":"Robust cicada","id":"robust-cicada","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/27","image":"https://acnhapi.com/v1/images/bugs/27","sellPrice":300,"rarity":"Common","museumFact":"The robust cicada got its name from the chirping sound it makes, which is said to be quite...well...robust. But \"robust\" hardly describes it. Abrasive! Bombastic! Cacophonous! That's more like it! Beside the horrid caterwauling, this bug is known for its long wings, short body, and green coloring. But looking at a robust cicada is just as unpleasant as listening to one. My eyes AND my ears are offended.","times":[[8,17]]},{"type":"bug","locations":["On trees"],"name":"Giant cicada","id":"giant-cicada","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/28","image":"https://acnhapi.com/v1/images/bugs/28","sellPrice":500,"rarity":"Uncommon","museumFact":"The giant cicada is rather aptly named. That is, it's a truly enormous bug. Ugh! These beasts spend most of their lives underground where they gorge on tree roots. But once they emerge, they make an awful racket. In fact, some say their song sounds like a shrieking siren. I would rather listen to nails on a chalkboard.","times":[[8,17]]},{"type":"bug","locations":["On trees"],"name":"Walker cicada","id":"walker-cicada","monthsAvailable":[8,9],"icon":"https://acnhapi.com/v1/icons/bugs/29","image":"https://acnhapi.com/v1/images/bugs/29","sellPrice":400,"rarity":"Common","museumFact":"The walker cicada is quite the noisy thing. I tell you, this impolite pest simply canNOT abide the quiet. In the heat of summer, the male strikes up a strange rattling song, hoping to woo a mate. When other male cicadas hear this rhythmic racket, they join right in... As if it were a sing-along! My head aches at the thought of it.","times":[[8,17]]},{"type":"bug","locations":["On trees"],"name":"Evening cicada","id":"evening-cicada","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/30","image":"https://acnhapi.com/v1/images/bugs/30","sellPrice":550,"rarity":"Common","museumFact":"The evening cicada certainly knows how to ruin a quiet moment. As the sun sets, it strikes up a sad song so sonorous, one can't hear one's own thoughts! I'd feel sorry for its melancholy moods if it weren't so very vocal about how it feels. Ugh, please pipe down...","times":[[4,8],[16,19]]},{"type":"bug","locations":["On trees"],"name":"Cicada shell","id":"cicada-shell","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/31","image":"https://acnhapi.com/v1/images/bugs/31","sellPrice":10,"rarity":"Rare","museumFact":"Cicadas! The nerve! Not only are they loud, they leave their cicada shells lying about! When it's time for a cicada nymph to turn into an adult, you see, it clings to a tree and sheds its exoskeleton. Then it just leaves this shell of its former self hanging right there! Awful manners, really...and awfully terrifying too.","times":[[0,24]]},{"type":"bug","locations":["Flying"],"name":"Red dragonfly","id":"red-dragonfly","monthsAvailable":[9,10],"icon":"https://acnhapi.com/v1/icons/bugs/32","image":"https://acnhapi.com/v1/images/bugs/32","sellPrice":180,"rarity":"Common","museumFact":"I won't deny that the wretched red dragonfly is an elegant aeronaut. It manipulates its four wings quite uniquely so it can hover and maneuver through the air with ease. But the veins on its wings! What ghastly things! One can't help but gasp at the sight of them... Appalling aerodynamics, indeed!","times":[[8,19]]},{"type":"bug","locations":["Flying"],"name":"Darner dragonfly","id":"darner-dragonfly","monthsAvailable":[4,5,6,7,8,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/33","image":"https://acnhapi.com/v1/images/bugs/33","sellPrice":230,"rarity":"Common","museumFact":"The darner dragonfly is the fastest dragonfly there is, flying at speeds up to 40 miles per hour! They all have a distinctive green hue, but the males have blue underbellies while females have yellow ones. It all sounds pleasant enough, no? Well, did you know their young eat tadpoles...and even some small fish! Worse, these creepy carnivores will eat each other in a pinch! Grotesque does not describe it...","times":[[8,17]]},{"type":"bug","locations":["Flying"],"name":"Banded dragonfly","id":"banded-dragonfly","monthsAvailable":[5,6,7,8,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/34","image":"https://acnhapi.com/v1/images/bugs/34","sellPrice":4500,"rarity":"Rare","museumFact":"The banded dragonfly is known for its black-and-yellow-striped body, as well as for its piercing green eyes. And it is those very eyes that help make dragonflies master hunters, you see. Alas, when one looks at me, I can't help but feel it is sizing me up for a meal! Hoot! The horrors! Look away, fiend!","times":[[8,17]]},{"type":"bug","locations":["Flying"],"name":"Damselfly","id":"damselfly","monthsAvailable":[11,12,1,2],"icon":"https://acnhapi.com/v1/icons/bugs/35","image":"https://acnhapi.com/v1/images/bugs/35","sellPrice":500,"rarity":"Common","museumFact":"The colorful damselfly is similar to its cousin, the dragonfly, though it tends to be smaller and thinner. But don't let the delicate looks fool you! Much like the dragonfly, the damselfly is a ruthless predator. It loves to catch flies midair and eat them, and has been known to snack on spiders it plucks from the web! In short, it is not a dinner guest I would recommend... And it is not a menu I could keep down.","times":[[0,24]]},{"type":"bug","locations":["Flying"],"name":"Firefly","id":"firefly","monthsAvailable":[6],"icon":"https://acnhapi.com/v1/icons/bugs/36","image":"https://acnhapi.com/v1/images/bugs/36","sellPrice":300,"rarity":"Common","museumFact":"The firefly isn't a fly at all! It is a beetle, you see—and one known for its ghastly glowing backside. This light is called \"bioluminescence\" and it is caused by...by...a chemical reaction in the rump. Males flash about in the night sky to attract females, while their larvae turn on the glow to put off predators. Speaking of their yucky young, firefly larvae love to dine on snails! Hoo! Ewwww!","times":[[0,4],[19,24]]},{"type":"bug","locations":["Underground"],"name":"Mole cricket","id":"mole-cricket","monthsAvailable":[11,12,1,2,3,4,5],"icon":"https://acnhapi.com/v1/icons/bugs/37","image":"https://acnhapi.com/v1/images/bugs/37","sellPrice":500,"rarity":"Common","museumFact":"Be warned, there is nowhere one might hide from the mole cricket. This plump pest has powerful front claws made for digging holes, and oh how it loves to burrow underground! A cousin to the grasshopper, it also has wings and can easily take to the air. And I swear this on my pinfeathers... Some have even been seen walking on water! Oh mercy, I may need a moment. This is making me feel rather woozy...","times":[[0,24]]},{"type":"bug","locations":["On ponds and rivers"],"name":"Pondskater","id":"pondskater","monthsAvailable":[5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/38","image":"https://acnhapi.com/v1/images/bugs/38","sellPrice":130,"rarity":"Common","museumFact":"Putrid pondskaters! They walk on water, you know...which is most preposterous! It is a trick they perform by secreting oil onto the hairs of their feet. To which I say BLEEECH! And one must wonder... What will they do next? Walk on air? Walk through walls? Perish the thought...","times":[[8,19]]},{"type":"bug","locations":["On ponds and rivers"],"name":"Diving beetle","id":"diving-beetle","monthsAvailable":[5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/39","image":"https://acnhapi.com/v1/images/bugs/39","sellPrice":800,"rarity":"Common","museumFact":"Ah, the dastardly diving beetle! Famous for its distinctive round shape...and its voracious appetite. This powerful predator uses thick back legs covered in hairs to paddle after its prey. And it uses suction cups on its front legs to grip its quarry for good. My own legs have gone weak thinking about it...","times":[[8,19]]},{"type":"bug","locations":["On ponds and rivers"],"name":"Giant water bug","id":"giant-water-bug","monthsAvailable":[4,5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/40","image":"https://acnhapi.com/v1/images/bugs/40","sellPrice":2000,"rarity":"Rare","museumFact":"How to put this gently? Ah yes... BEWARE the giant water bug! I tell you, this vicious predator has been known to attack fish, frogs, and even snakes! SNAKES! Truth be told, no one is safe! Its nickname is \"the toe-biter,\" for goodness sakes! Now, one final fact before I faint... The gruesome bug uses its nose...to inject its prey...with digestive juices. Hoo... Must stop thinking about...the unthinkable.","times":[[0,8],[19,24]]},{"type":"bug","locations":["On flowers"],"name":"Stinkbug","id":"stinkbug","monthsAvailable":[3,4,5,6,7,8,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/41","image":"https://acnhapi.com/v1/images/bugs/41","sellPrice":120,"rarity":"Common","museumFact":"I daresay the name says it all... Stinkbugs are known for their stench. Hoo! Peeyew! As it happens, these crop-eating pests use straw-like mouths to pierce plants and drink the juices. And when threatened, they use a smelly chemical in their belly to release their odious odor! Hoo! How DO they live with themselves?","times":[[0,24]]},{"type":"bug","locations":["On flowers"],"name":"Man-faced stink bug","id":"man-faced-stink-bug","monthsAvailable":[3,4,5,6,7,8,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/42","image":"https://acnhapi.com/v1/images/bugs/42","sellPrice":1000,"rarity":"Uncommon","museumFact":"Never mind this stink bug's smell. What you have here is a bug...with a FACE...on its BACK!! Wot-wot! Simply put, the man-faced stink bug has markings on its shell that resemble a human face. Once you notice this face, you cannot UN-notice it. Indeed, this face might haunt you forever. At least the face will distract you from the stink.","times":[[0,8],[19,24]]},{"type":"bug","locations":["On flowers"],"name":"Ladybug","id":"ladybug","monthsAvailable":[3,4,5,6,10],"icon":"https://acnhapi.com/v1/icons/bugs/43","image":"https://acnhapi.com/v1/images/bugs/43","sellPrice":200,"rarity":"Common","museumFact":"Yes. Yes. Ladybugs are quite beloved thanks to their tiny round shape and adorable spots. To that I say BAH! The fact of the matter is, some have stripes instead of spots. And SOME have no markings at all! No, I shall never understand why it is said that when a ladybug lands on you...you'll have good luck. I shall only have a fainting spell.","times":[[8,17]]},{"type":"bug","locations":["On the ground"],"name":"Tiger beetle","id":"tiger-beetle","monthsAvailable":[2,3,4,5,6,7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/44","image":"https://acnhapi.com/v1/images/bugs/44","sellPrice":1500,"rarity":"Uncommon","museumFact":"The tiger beetle is extremely fleet of foot, though it runs in a rather peculiar way. That is, it sprints, then stops, then sprints again...using these speedy maneuvers to run down its prey. You see, the tiger beetle—like a real tiger—is a powerful predator. The mere thought of it giving chase gives me the willies. Tigers are terrifying at any size.","times":[[0,24]]},{"type":"bug","locations":["On tree stumps"],"name":"Jewel beetle","id":"jewel-beetle","monthsAvailable":[4,5,6,7,8],"icon":"https://acnhapi.com/v1/icons/bugs/45","image":"https://acnhapi.com/v1/images/bugs/45","sellPrice":2400,"rarity":"Uncommon","museumFact":"The green shimmer of the jewel beetle's wings is nothing short of nauseating...yes? No? Well, so says you. Though...jewel beetles were once prized by collectors who turned their iridescent wings into pretty jewelry. Why anyone would want to wear bug parts on their body is beyond me. Fashion foul indeed.","times":[[0,24]]},{"type":"bug","locations":["On tree stumps"],"name":"Violin beetle","id":"violin-beetle","monthsAvailable":[5,6,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/46","image":"https://acnhapi.com/v1/images/bugs/46","sellPrice":450,"rarity":"Common","museumFact":"The violin beetle gets its name from its shape. That is, SOME think it resembles the stringed instrument. If you ask me, this is an insult to violins! With its flat body and small head, the violin beetle looks like nothing but a repulsive bug, plain and simple. In fact it is so repulsive, it oozes a foul liquid when frightened! Ugh! This insect strikes a sour note indeed.","times":[[0,24]]},{"type":"bug","locations":["On tree stumps"],"name":"Citrus long-horned beetle","id":"citrus-long-horned-beetle","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/47","image":"https://acnhapi.com/v1/images/bugs/47","sellPrice":350,"rarity":"Common","museumFact":"The citrus long-horned beetle is a putrid pest and a grave threat to trees. Hoo! It's true! Adults possess powerful jaws and use them to chomp through hard wood and plant fibers with ease. The little larvae are no better, boring bullet-like holes into innocent trees with gusto—citrus trees especially. Voracious and vile, indeed!","times":[[0,24]]},{"type":"bug","locations":["On tree stumps"],"name":"Rosalia batesi beetle","id":"rosalia-batesi-beetle","monthsAvailable":[5,6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/48","image":"https://acnhapi.com/v1/images/bugs/48","sellPrice":3000,"rarity":"Uncommon","museumFact":"The rosalia batesi beetle is a type of longhorn beetle, so named for the long antenna upon its head. But did you know that longhorn beetles often grow antenna LONGER than their very own bodies, wot wot? As if this weren't odious enough, look closely and you will find these antenna...are covered in tufts of hair! Best not look closely, I say.","times":[[0,24]]},{"type":"bug","locations":["On trees"],"name":"Blue weevil beetle","id":"blue-weevil-beetle","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/49","image":"https://acnhapi.com/v1/images/bugs/49","sellPrice":800,"rarity":"Common","museumFact":"Yes, yes. The blue weevil beetle does come in beautiful shades of blue and green. The colors are so bright, some say it looks like a living jewel. But I say it looks like a weevil...and weevil rhymes with EVIL. Draw your own conclusions from there. Hoot! I certainly have!","times":[[0,24]]},{"type":"bug","locations":["On the ground"],"name":"Dung beetle","id":"dung-beetle","monthsAvailable":[12,1,2],"icon":"https://acnhapi.com/v1/icons/bugs/50","image":"https://acnhapi.com/v1/images/bugs/50","sellPrice":3000,"rarity":"Common","museumFact":"What can I say? The aptly-named dung beetle feeds on the feces of animals. Hoo! You heard right! This putrid pest rolls up balls of dung...and then rolls them away to dine on at a later date. As if that weren't atrocious enough, some dung beetles lay their eggs in the feces too! What a dreadful place to raise the young.","times":[[0,24]]},{"type":"bug","locations":["On the ground"],"name":"Earth-boring dung beetle","id":"earth-boring-dung-beetle","monthsAvailable":[7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/51","image":"https://acnhapi.com/v1/images/bugs/51","sellPrice":300,"rarity":"Common","museumFact":"Earth-boring dung beetles are considered quite handsome by some, thanks to their metallic luster. In fact, some even think them to be good omens and bringers of favorable fortune. But I must protest! These field- ravaging pests love to burrow under piles of dung and lay their eggs. They raise their young under DUNG! Need I say more? Ick. I think not.","times":[[0,24]]},{"type":"bug","locations":["On trees"],"name":"Scarab beetle","id":"scarab-beetle","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/52","image":"https://acnhapi.com/v1/images/bugs/52","sellPrice":10000,"rarity":"Rare","museumFact":"Collectors consider the scarab beetle quite the prize, thanks to its shiny metallic shell. But did you know this bug has no nose and uses its antenna to sense smells instead? In fact, the scarab beetle's plated antenna are quite unique and set it apart from other beetles. But ALL antennae are equally awful in my book.","times":[[0,8],[23,24]]},{"type":"bug","locations":["On trees"],"name":"Drone beetle","id":"drone-beetle","monthsAvailable":[6,7,8],"icon":"https://acnhapi.com/v1/icons/bugs/53","image":"https://acnhapi.com/v1/images/bugs/53","sellPrice":200,"rarity":"Common","museumFact":"I must say, the drone beetle is like that boorish acquaintance who is much too loud for polite company. That is, it is a large bug with a square head and is so named for the droning noise it makes when it flies. Furthermore, it has hooks on its feet that help it to cling tightly to trees. HOOK FEET... How gauche!","times":[[0,24]]},{"type":"bug","locations":["On palm trees"],"name":"Goliath beetle","id":"goliath-beetle","monthsAvailable":[6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/54","image":"https://acnhapi.com/v1/images/bugs/54","sellPrice":8000,"rarity":"Ultra-rare","museumFact":"Hoo! Ewww! The goliath beetle is a colossal creature that can grow up to four-inches long. Yes, they love to sup on sap and pollen, and frolic among the flowers. But did you know, the goliath beetle has a horn upon its head that it uses to fight its foes? And picture this... Each one of this behemoth's legs ends in pincers! Deep...calming...breaths...","times":[[0,8],[17,24]]},{"type":"bug","locations":["On trees"],"name":"Saw stag","id":"saw-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/55","image":"https://acnhapi.com/v1/images/bugs/55","sellPrice":2000,"rarity":"Common","museumFact":"The saw stag got its name from the shape of its pincers. That is, its pincers look like jagged saws! And I tell you, the bigger the beetle, the more saw-like teeth its giant jaws have. I say the saw stag seems more at home in a horror film than in nature. I have terrified myself just talking about it.","times":[[0,24]]},{"type":"bug","locations":["On trees"],"name":"Miyama stag","id":"miyama-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/56","image":"https://acnhapi.com/v1/images/bugs/56","sellPrice":1000,"rarity":"Common","museumFact":"The miyama stag has protrusions on its head that resemble ears... And yet, the ugly lumps are not ears! It is, however, called a \"stag\" beetle because of the large, deer-like horns upon its head. And the word \"miyama\" in its name means \"deep mountain\" in Japanese. Feel free to call it what you like. I will simply call it DISGUSTING. \"Disgusting stag beetle\" does have a ring.","times":[[0,24]]},{"type":"bug","locations":["On trees"],"name":"Giant stag","id":"giant-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/57","image":"https://acnhapi.com/v1/images/bugs/57","sellPrice":10000,"rarity":"Rare","museumFact":"It is said the giant stag is a popular pet among bug enthusiasts. Though how one might consider oneself enthusiastic about bugs is quite beyond me... But I digress. Giant stags look fearsome with their enormous curved mandibles. But in truth, they're really quite cowardly. Oh how they love to hide away in rotting wood, only to reveal themselves under the cover of dark. Hoot! I shall never turn off the lights again!","times":[[0,8],[23,24]]},{"type":"bug","locations":["On trees"],"name":"Rainbow stag","id":"rainbow-stag","monthsAvailable":[6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/58","image":"https://acnhapi.com/v1/images/bugs/58","sellPrice":6000,"rarity":"Rare","museumFact":"Rainbows are beautiful things, I'm sure we all agree. But rainbow stag beetles? Bleech! Yes, yes, this beetle's back and belly shine with a pretty rainbow- colored luster. But that does not change the fact this bug has large pincers on its face and loves to pick a fight! If one can wish upon a rainbow, then I wish to stay far away from the rainbow stag. Perhaps I've picked the wrong profession.","times":[[0,8],[19,24]]},{"type":"bug","locations":["On palm trees"],"name":"Cyclommatus stag","id":"cyclommatus-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/59","image":"https://acnhapi.com/v1/images/bugs/59","sellPrice":8000,"rarity":"Ultra-rare","museumFact":"The cyclommatus stag is known for its giant jaws, which can be even larger than its body. Its round eyes and silver color make it a beloved beetle. Though how one could love a beetle is beyond me. Imagine being pinched by those long jaws, and the pain it would cause! Ouch and ewww!","times":[[0,8],[17,24]]},{"type":"bug","locations":["On palm trees"],"name":"Golden stag","id":"golden-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/60","image":"https://acnhapi.com/v1/images/bugs/60","sellPrice":12000,"rarity":"Ultra-rare","museumFact":"Yes. Yes. The golden stag beetle is quite the prize thanks to its metallic gold coloring. But let me speak plainly... The golden stag is NOT made of gold. It is made of BUG, through and through. And thus it is vile! Golden stag? Bah! Gross stag is more like it.","times":[[0,8],[17,24]]},{"type":"bug","locations":["On palm trees"],"name":"Giraffe stag","id":"giraffe-stag","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/61","image":"https://acnhapi.com/v1/images/bugs/61","sellPrice":12000,"rarity":"Ultra-rare","museumFact":"The giraffe stag beetle is a bug of preposterous proportions. Not only is its body rather large, it has two long, jagged jaws that can put it over five inches in size! The giraffe stag beetle's long jaws have been compared to the long neck of the giraffe...hence the name. But I say such comparisons are a stretch. Giraffe necks are NOT lined with spikes! If I were a giraffe, I would protest.","times":[[0,8],[17,24]]},{"type":"bug","locations":["On trees"],"name":"Horned dynastid","id":"horned-dynastid","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/62","image":"https://acnhapi.com/v1/images/bugs/62","sellPrice":1350,"rarity":"Common","museumFact":"The horned dynastid's head is shaped like a samurai warrior's helmet, hootie-hoo! It would be a most impressive fact if their large size wasn't so horrifying! Adult males use their huge horned heads for fighting and digging, while the females have no such need. As for their larvae and pupae, they too are quite large and feed on rotting wood at a tremendous pace. A foul feast, indeed!","times":[[0,8],[17,24]]},{"type":"bug","locations":["On palm trees"],"name":"Horned atlas","id":"horned-atlas","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/63","image":"https://acnhapi.com/v1/images/bugs/63","sellPrice":8000,"rarity":"Ultra-rare","museumFact":"Beware the horned atlas! I tell you, this rhinoceros beetle is known for its violent temperament! The males use the three large horns on their heads to fight amongst each other for dominance. But it is their young that truly give me the cold sweats. You see, their larvae grow quite large and, worst of all...they bite! It is the stuff of nightmares, I say.","times":[[0,8],[17,24]]},{"type":"bug","locations":["On palm trees"],"name":"Horned elephant","id":"horned-elephant","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/64","image":"https://acnhapi.com/v1/images/bugs/64","sellPrice":8000,"rarity":"Ultra-rare","museumFact":"The horned elephant beetle certainly lives up to its namesake. Not only does the horn on its head resemble the trunk of an elephant... It is also one of the heaviest beetles in the world! Size aside, allow me to reveal the real reason I find horned elephant beetles so repugnant... Their backs are covered in a fine coat of hair! Hirsute beetles! Hoot! The horror!","times":[[0,8],[17,24]]},{"type":"bug","locations":["On palm trees"],"name":"Horned hercules","id":"horned-hercules","monthsAvailable":[7,8],"icon":"https://acnhapi.com/v1/icons/bugs/65","image":"https://acnhapi.com/v1/images/bugs/65","sellPrice":12000,"rarity":"Ultra-rare","museumFact":"The horned hercules is not only known for its tremendous strength, but for its size as well. It can grow up to seven-inches long and has powerful pincers covered in hair that help with gripping! As if this weren't ghastly enough, these behemoth beetles let loose a foul odor that fends off enemies... And offends my sense of smell.","times":[[0,8],[17,24]]},{"type":"bug","locations":["On trees"],"name":"Walking stick","id":"walking-stick","monthsAvailable":[7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/66","image":"https://acnhapi.com/v1/images/bugs/66","sellPrice":600,"rarity":"Uncommon","museumFact":"The walking stick looks just like a twig, does it not? Hoo! It even has knots like a real twig would! These bashful bugs mimic plants in this way to hide from predators. A noble goal, you might say. But though the deceptive wretches fool some, they do not fool me! I see these bugs for what they are... Monsters, plain and simple! I say, did you know that walking sticks can grow to two feet long?! Imagine running into one! Surely I would faint.","times":[[4,8],[17,19]]},{"type":"bug","locations":["Under trees"],"name":"Walking leaf","id":"walking-leaf","monthsAvailable":[7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/67","image":"https://acnhapi.com/v1/images/bugs/67","sellPrice":600,"rarity":"Uncommon","museumFact":"What a fraud! What a phony! The walking leaf is, in fact, the very embodiment of a lie! This master mimic looks like a tree leaf all the way down to the tiniest details. In fact, this bug has been known to sway to and fro as it walks...just so it looks like a leaf blown by the wind! And the fakery works! These insects look so much like leaves that even leaf-eating insects nibble on them! Lying liars, indeed!","times":[[0,24]]},{"type":"bug","locations":["Shaking trees"],"name":"Bagworm","id":"bagworm","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/68","image":"https://acnhapi.com/v1/images/bugs/68","sellPrice":600,"rarity":"Common","museumFact":"The bagworm is, in fact, not a worm at all, but a caterpillar instead. The filthy fraud uses silk and leaves to spin a cozy bag for it to hide inside—hence the name. Some find it cute the way bagworms dangle from trees. But the truth is they're gluttonous monsters. These beasts love to stuff their bug- gullets full of leaves, devouring the very trees they hang upon. Wretched villains is what they are.","times":[[0,24]]},{"type":"bug","locations":["On rotten food"],"name":"Ant","id":"ant","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/69","image":"https://acnhapi.com/v1/images/bugs/69","sellPrice":80,"rarity":"Common","museumFact":"I warn you, the ant may be a small bug, but it finds scary strength in numbers. You see, the ant itself is the strongest creature in the world in relation to its size. One of these diminutive fiends can carry 50 times its own bodyweight! And if it wants to lift something even larger... Why, it simply calls on its ant friends to join the effort. Creepy cooperation, I say...","times":[[0,24]]},{"type":"bug","locations":["On the beach"],"name":"Hermit crab","id":"hermit-crab","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/70","image":"https://acnhapi.com/v1/images/bugs/70","sellPrice":1000,"rarity":"Common","museumFact":"The hermit crab is not an insect... Though it most certainly resembles one. Blech! It looks much like a spider—what with its creepy eyes and crawly legs—but is, in fact, a crustacean. As such, the hermit crab has 10 legs and also wears a shell. But it doesn't grow this shell itself. It slips its soft body into shells left behind by snails, you see, and moves into ever-larger ones as it grows. Talk about a strange way to make a home.","times":[[0,8],[19,24]]},{"type":"bug","locations":["On beach rocks"],"name":"Wharf roach","id":"wharf-roach","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/71","image":"https://acnhapi.com/v1/images/bugs/71","sellPrice":200,"rarity":"Common","museumFact":"The wharf roach is an omnivore, which is merely a polite way of saying it will eat almost anything. This skittering scavenger and its uncouth appetite help keep beaches clean, it's said. But I dare say, their long antenna and bulging eyes turn MY stomach. Unappetizing indeed...","times":[[0,24]]},{"type":"bug","locations":["Near trash"],"name":"Fly","id":"fly","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/72","image":"https://acnhapi.com/v1/images/bugs/72","sellPrice":60,"rarity":"Common","museumFact":"The foul fly is quite the disquieting creature. I tell you, it tastes its food with its feet! Yeep! In fact, when flies rub their legs together, they do so to get rid of debris blocking their taste receptors. And did you know, their hairy toes release a sticky goo so they can walk on any surface? Even your ceiling! This gross goo gets on your food too!","times":[[0,24]]},{"type":"bug","locations":["Flying"],"name":"Mosquito","id":"mosquito","monthsAvailable":[6,7,8,9],"icon":"https://acnhapi.com/v1/icons/bugs/73","image":"https://acnhapi.com/v1/images/bugs/73","sellPrice":130,"rarity":"Common","museumFact":"As everyone knows, the mosquito is a vampiric pest that sucks blood from innocent bystanders. But did you know that only the females suck blood? Hoo! It's true! They need it to make their eggs. When they sink their snout into our skin, they inject us with a saliva that helps them slurp up their meal. It's that saliva that makes us itch and scratch, you know. Hoo! So rude!","times":[[0,4],[17,24]]},{"type":"bug","locations":["On villagers"],"name":"Flea","id":"flea","monthsAvailable":[4,5,6,7,8,9,10,11],"icon":"https://acnhapi.com/v1/icons/bugs/74","image":"https://acnhapi.com/v1/images/bugs/74","sellPrice":70,"rarity":"Common","museumFact":"Allow me to be blunt. The flea is foul! It is also disgusting, repugnant, and vile! Hoo! But I digress... This horrid pest sucks the blood of humans and animals. In fact, it is the flea's own saliva that makes us itch! And did you know their legs are so strong, they can jump more than 50 times their body length? So you see, it's all too easy for a flea to jump from you to me! I itch at the very thought.","times":[[0,24]]},{"type":"bug","locations":["On rocks (when raining)"],"name":"Snail","id":"snail","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/75","image":"https://acnhapi.com/v1/images/bugs/75","sellPrice":250,"rarity":"Common","museumFact":"Snails are not insects, I'll admit. But they're just as revolting to me. Snails are mollusks, you see, and are born wearing shells they cannot remove. Instead, their shells get bigger and bigger as they grow. Hoo! They must get heavy, don't you know! I suppose that's why they need a trail of mucus to move about. A truly foul form of transportation.","times":[[0,24]]},{"type":"bug","locations":["Hitting rocks"],"name":"Pill bug","id":"pill-bug","monthsAvailable":[9,10,11,12,1,2,3,4,5,6],"icon":"https://acnhapi.com/v1/icons/bugs/76","image":"https://acnhapi.com/v1/images/bugs/76","sellPrice":250,"rarity":"Common","museumFact":"Blech, the pill bug! Children delight at the way these beasts roll into balls when poked... But the appeal is utterly lost on me. One look at their leggy undersides... Hoo! Ewww! How they wriggle! Young pill bugs shed their exo- skeletons as they grow, and in doing so, sprout another pair of legs. As if 12 appendages weren't alarming enough! Yuck, I say. Yuck!","times":[[0,16],[23,24]]},{"type":"bug","locations":["Hitting rocks"],"name":"Centipede","id":"centipede","monthsAvailable":[9,10,11,12,1,2,3,4,5,6],"icon":"https://acnhapi.com/v1/icons/bugs/77","image":"https://acnhapi.com/v1/images/bugs/77","sellPrice":300,"rarity":"Common","museumFact":"The centipede's name means \"100 legs.\" But I tell you now, that's a lie! These ugly bugs can have as few as 15 pairs of legs...or as many as 171. But because of how their bodies are segmented, they never have exactly 100! Hoo! It's true! You know what else is true? Centipedes are carnivorous, aggressive, and venomous! And their bite is quite painful too! HOO-rrible things, I say.","times":[[16,23]]},{"type":"bug","locations":[""],"name":"Spider","id":"spider","monthsAvailable":[1,2,3,4,5,6,7,8,9,10,11,12],"icon":"https://acnhapi.com/v1/icons/bugs/78","image":"https://acnhapi.com/v1/images/bugs/78","sellPrice":480,"rarity":"Common","museumFact":"The spider is renowned for having eight eyes and eight legs... WHICH IS SIX TOO MANY, I SAY! Oh dear. I do apologize. Now where was I? Most spiders are carnivorous. In fact, some will eat creatures several times larger than themselves. To catch their prey, many of these ruthless predators spin sticky webs of surprising strength. Worse yet, they've also been known to ambush their victims, and some even chase down their meals! All this talk about the feeding habits of spiders... I'm feeling quite queasy. Hoot! The horror!","times":[[0,8],[19,24]]},{"type":"bug","locations":["On the ground"],"name":"Tarantula","id":"tarantula","monthsAvailable":[11,12,1,2,3,4],"icon":"https://acnhapi.com/v1/icons/bugs/79","image":"https://acnhapi.com/v1/images/bugs/79","sellPrice":8000,"rarity":"Common","museumFact":"As giant spiders go, the tarantula is said to be quite docile. But have you ever seen such foul fuzziness?! It is a fact, tarantulas have barbed belly hair! I say again...BARBED. BELLY. HAIR! These awful arachnids let loose their spiky, itchy hairs to protect themselves from predators. But seeing how tarantulas also prey on frogs, mice, and even birds, one must ask... Who needs protecting from whom?! Hoo! Who indeed!","times":[[0,4],[19,24]]},{"type":"bug","locations":["On the ground"],"name":"Scorpion","id":"scorpion","monthsAvailable":[5,6,7,8,9,10],"icon":"https://acnhapi.com/v1/icons/bugs/80","image":"https://acnhapi.com/v1/images/bugs/80","sellPrice":8000,"rarity":"Common","museumFact":"The scorpion...how should I put this? Those legs! Those pincers! That tail! And that venomous stinger! It's as if someone took all the most awful insect parts...and put them together to make the scorpion! All scorpions are venomous, you know! Though I understand that only a few kinds are truly deadly. I fear I might die just thinking about it.","times":[[0,4],[19,24]]}]}