{
    "core": {
        "level": {
            "0": "The psychic’s touch can automatically stabilize a mortally-wounded target as a Main Action. This power must be used on a target within six rounds of their collapse, and does not function on targets that have been decapitated or killed by Heavy weapons. It’s the GM’s decision as to whether a target is intact enough for this power to work.",
            "1": "As level-0, and heal 1d6+1 hit points of damage. If used on a mortally-wounded target, they revive with the rolled hit points and can act normally on the next round.",
            "2": "As level-1, but healing 2d6+2 hit points instead.",
            "3": "As level-2, but healing 2d6+6 hit points instead.",
            "4": "As level-3, but healing 3d6+8 hit points instead. "
        },
        "description": "The adept’s touch stabilizes critically-wounded organisms. More sophisticated practitioners can heal tissue injuries, though curing diseases, detoxifying poisons, and fixing congenital deformities require additional techniques. Each use of Psychic Succor adds one point of System Strain to the target, or two points if they were mortally wounded at the time. Activating Psychic Succor requires the biopsion to Commit Effort for the day. Once used, they can continue to use it for the rest of that scene without Committing Effort again. Level-0"
    },
    "additional": [
        {
            "title": "System Strain",
            "description": "Many curative biopsionic powers add to the target’s System Strain. System Strain is a measure of the amount of system stress, intrusive modification, and general biological distress an organism might be suffering. Psionic healing, cybernetic implants, and powerful drugs all add to a target’s System Strain. If using a power or drug on a target would make their System Strain exceed their Constitution score, the effect fails to function; their body simply cannot adapt to the changes and cannot benefit from them. System Strain decreases automatically by one point after each night of rest, provided the organism is wellfed and not compromised by sickness or privation. "
        }
    ],
    "techniques": [
        {
            "title": "Mastered Succor",
            "internalName": "mastered_succor",
            "description": "The biopsion has developed a sophisticated mastery of their core ability, and they no longer need to Commit Effort to activate it, and may use it whenever they wish. The use of additional techniques that augment Psychic Succor might still require Effort to be Committed. Organic Purification Protocols",
            "minLevel": 1
        },
        {
            "title": "Organic Purification Protocols",
            "internalName": "organic_purification_protocols",
            "description": "The biopsion’s Psychic Succor now cures any poisons or diseases the subject may be suffering, albeit it requires Committing Effort for the day as an additional surcharge. Biowarfare organisms, exceptionally virulent diseases, or TL5 toxins may resist this curing, requiring a Wis/Biopsionics skill check at a difficulty of at least 10. Failure means that the adept cannot cure the target’s disease. This technique cannot cure congenital illnesses. Remote Repair",
            "minLevel": 1
        },
        {
            "title": "Remote Repair",
            "internalName": "remote_repair",
            "description": "Psychic Succor and other biopsionic techniques that normally require touch contact can now be applied at a distance up to 100 meters, provided the biopsion can see the target with their unaided vision. Hostile powers that normally require a hit roll will hit automatically. Each time this technique is used, Effort must be Committed for the scene. Invincible Stand",
            "minLevel": 1
        },
        {
            "title": "Invincible Stand",
            "internalName": "invincible_stand",
            "description": "The biopsion has mastered techniques of emergency tissue reinforcement and system stabilization. As an Instant action, they can Commit Effort for the scene to keep themself or a target they can touch active even at zero hit points. This technique must be used once every round on the target or they collapse at the end of the round. If the target suffers hit point damage, the biopsion must Instantly Commit Effort for the scene or the target goes down immediately with a mortal wound. A Heavy weapon hit on a subject of this power or similar physical dismemberment will always kill a target, regardless of this technique. Major Organ Restoration",
            "minLevel": 2
        },
        {
            "title": "Major Organ Restoration",
            "internalName": "major_organ_restoration",
            "description": "The biopsion’s Psychic Succor can now cure congenital birth defects and regrow missing limbs and organs. It can even be used to stabilize targets that have been dropped by Heavy weapons, decapitated, or otherwise dramatically dismembered, provided it’s used within one round per level of Biopsionic skill. The best that can be done for such badly-mangled targets is stabilization, after which they must rest for 24 hours before any further hit points can be healed by Biopsionics, stims, or natural rest. Tissue Integrity Field",
            "minLevel": 2
        },
        {
            "title": "Tissue Integrity Field",
            "internalName": "tissue_integrity_field",
            "description": "The biopsion’s Psychic Succor may now also affect all allies within ten meters of the target. Allies can decline the healing if they don’t require it or don’t want to take the additional System Strain. Each use of this technique requires that the biopsion Commit Effort for the day in addition to the cost of the Psychic Succor. Accelerated Succor",
            "minLevel": 2
        },
        {
            "title": "Accelerated Succor",
            "internalName": "accelerated_succor",
            "description": "The biopsion’s Psychic Succor now can be used as an On Turn power, albeit only once per round. By Committing an additional Effort for the day with each use, it can even be used as an Instant power, though it still can only be used once per round. Any surcharges for augmenting the succor apply normally, such as with Tissue Integrity Field. Metamorph",
            "minLevel": 3
        },
        {
            "title": "Metamorph",
            "internalName": "metamorph",
            "description": "The biopsion can now shape their own or another willing target’s physical form as a Main Action, transforming a touched target into any humanoid form within 50% of their own mass. Claws and other body armaments can be fashioned equivalent to Light or Medium melee weapons and innate armor equivalent to AC 13. Gills and other environmental-survival alterations are also viable at the GM’s discretion, but flight is a bridge too far for this power. A person can be impersonated down to the DNA level, provided a blood or hair sample is available. The use of this adds one System Strain point to the target that does not recover so long as the change is in effect. Applying Metamorph requires that the biopsion Commit Effort for as long as the change is to be maintained. If applied to a target other than the psychic, the power automatically ends if the psychic gets more than one hundred kilometers away. Teratic Overload",
            "minLevel": 3
        },
        {
            "title": "Teratic Overload",
            "internalName": "teratic_overload",
            "description": "This use of biopsionics inflicts potentially-lethal damage on a touched target as a Main Action, and requires that the biopsion Commit Effort for the scene. The target suffers 1d6 damage per level of the psychic’s Biopsionics skill and must make a Physical saving throw. On a failure, the damage is tripled and the target is now affected by an obvious, lethal cancer that will kill them in 1d6 months. The cancer can be treated by a TL4 hospital or ship’s sick bay if managed within a month’s time. If the biopsion Commits Effort for the day instead of the scene, they can control the power sufficiently to do no hit point damage and create very subtle tumors, leaving the cancer undetectable without a TL4 medical examination. Such victims probably won’t even know they’ve been attacked by this power. Whether a success or failure, this power cannot be used on the same target more than once per scene. Holistic Optimization Patterning",
            "minLevel": 3
        },
        {
            "title": "Holistic Optimization Patterning",
            "internalName": "holistic_optimization_patterning",
            "description": "The biopsion gains the ability to drastically augment their own or a touched ally’s physical abilities as an On Turn action. This boost lasts for the rest of the scene, adds two points of System Strain to the target and gives them a +2 bonus to all Strength or Dexterity skill checks, hit rolls, and damage rolls along with 20 extra hit points. Any damage is taken off these temporary hit points first, and both the bonuses and any hit points in excess of the target’s maximum are lost at the end of the scene. Each invocation of this technique requires the biopsion to Commit Effort for the day, and this power cannot be used on a given target more than once per scene. Quintessential Reconstruction",
            "minLevel": 4
        },
        {
            "title": "Quintessential Reconstruction",
            "internalName": "quintessential_reconstruction",
            "description": "The biopsion becomes extremely difficult to kill, encoding their mind in a coherent pattern of MES energy coterminous with their realspace coordinates. If killed, the psychic will regenerate from the largest remaining fragment of their body over 24 hours. This process maximizes their System Strain for one week. If brought to zero hit points during this week, they die instantly and permanently. The psychic retains a vague awareness of their surroundings while “dead” and can postpone their regeneration for up to a week in order to avoid notice, but burial or entombment may result in a very short second life. Each use of this power inflicts one point of permanent attribute loss in an attribute of the biopsion’s choice. ",
            "minLevel": 4
        }
    ],
    "title": "Biopsionics",
    "internalTitle": "biopsionics",
    "description": "Biopsionics Biopsionic powers repair, augment, debilitate, or damage living creatures. Unless otherwise specified the biopsionicist must be able to touch a target, though clothing and armor do not interfere with the use of these abilities. Touching a willing or unsuspecting target is automatic, whereas touching a resisting target requires a normal Punch hit roll with a bonus equal to the practitioner’s Biopsionics skill. Such touch effects do not inflict the normal damage of a Punch attack. Unsurprisingly, biopsionic powers are among the most accepted psychic abilities. Even a modestly-experienced biopsion can perform miracles of healing for a community lucky enough to have their services. "
}
